In [108]:
print("""
@Description: The DataFrame object
@Author(s): Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime: 2023-06-16 21:02:56
""")

@Description: The DataFrame object
@Author(s): Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime: 2023-06-16 21:02:56

# The DataFrame object

This chapter covers
- Instantiating DataFrame objects from dictionaries and NumPy ndarrays
- Importing DataFrames from CSV files with the read_csv function
- Sorting DataFrame columns
- Accessing rows and columns in a DataFrame
- Setting and resetting a DataFrame index
- Renaming columns and index labels in a DataFrame

In [109]:
import numpy as np
import pandas as pd

## Overview of a DataFrame

In [110]:
city_data = {
    'City': ['New York City', 'Paris', 'Barcelona', 'Rome'],
    'Country': ['United States', 'France', 'Spain', 'Italy'],
    'Population': [8_600_000, 2_141_000, 5_515_000, 2_873_000],
}
cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [111]:
cities.transpose()
cities.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [112]:
random_data = np.random.randint(1, 101, size=(3, 5))
random_data

array([[50, 76, 15, 33, 29],
       [88, 72, 87, 13, 76],
       [55, 84, 38, 48, 86]])

In [113]:
pd.DataFrame(data=random_data)

    0   1   2   3   4
0  50  76  15  33  29
1  88  72  87  13  76
2  55  84  38  48  86

In [114]:
row_labels = ['Morning', 'Afternoon', 'Evening']
temperatures = pd.DataFrame(data=random_data, index=row_labels)
temperatures

            0   1   2   3   4
Morning    50  76  15  33  29
Afternoon  88  72  87  13  76
Evening    55  84  38  48  86

In [115]:
column_labels = ('Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday')
pd.DataFrame(data=random_data, index=row_labels, columns=column_labels)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        50       76         15        33      29
Afternoon      88       72         87        13      76
Evening        55       84         38        48      86

In [116]:
row_labels = ['Morning', 'Afternoon', 'Morning']
column_labels = ('Monday', 'Tuesday', 'Wednesday', 'Tuesday', 'Friday')
pd.DataFrame(data=random_data, index=row_labels, columns=column_labels)

           Monday  Tuesday  Wednesday  Tuesday  Friday
Morning        50       76         15       33      29
Afternoon      88       72         87       13      76
Morning        55       84         38       48      86

## Similarities between Series and DataFrames

In [117]:
pd.read_csv('nba.csv')

               Name                 Team Position  Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG   9/26/96   1445697
1    Christian Wood      Detroit Pistons       PF   9/27/95   1645357
2     PJ Washington    Charlotte Hornets       PF   8/23/98   3831840
3      Derrick Rose      Detroit Pistons       PG   10/4/88   7317074
4     Marial Shayok   Philadelphia 76ers        G   7/26/95     79568
..              ...                  ...      ...       ...       ...
445   Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446     Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447     Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448   Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449     Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

[450 rows x 5 columns]

In [118]:
pd.read_csv('nba.csv', parse_dates=['Birthday'], date_format='%m/%d/%y')

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [119]:
nba = pd.read_csv('nba.csv', parse_dates=['Birthday'], date_format='%m/%d/%y')

In [120]:
pd.Series([1, 2, 3]).dtype

dtype('int64')

In [121]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [122]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
Name: count, dtype: int64

In [123]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [124]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [125]:
nba.ndim

2

In [126]:
nba.shape

(450, 5)

In [127]:
nba.size

2250

In [128]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [129]:
assert nba.count().sum() == 2250

In [130]:
data = {
    'A': [1, np.nan],
    'B': [2, 3]
}
df = pd.DataFrame(data=data)
df

     A  B
0  1.0  2
1  NaN  3

In [131]:
assert df.size == 4

In [132]:
assert df.count().sum() == 3

### Shared methods of Series and DataFrames

In [133]:
nba.head(2)

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

In [134]:
nba.tail(n=3)

              Name                 Team Position   Birthday    Salary
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

In [135]:
nba.sample(3)

             Name               Team Position   Birthday   Salary
385  Kobi Simmons  Charlotte Hornets       PG 1997-07-04    79568
313    RJ Barrett    New York Knicks       SG 2000-06-14  7839960
173    Coby White      Chicago Bulls       SG 2000-02-16  5307120

In [136]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [137]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [138]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [139]:
nba.nlargest(n=3, columns='Salary')

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482

In [140]:
nba.nsmallest(n=3, columns='Birthday')

              Name             Team Position   Birthday   Salary
98    Vince Carter    Atlanta Hawks       PF 1977-01-26  2564753
196  Udonis Haslem       Miami Heat        C 1980-06-09  2564753
262    Kyle Korver  Milwaukee Bucks       PF 1981-03-17  6004753

In [141]:
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [142]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [143]:
nba.median(numeric_only=True)

Salary    3303074.5
dtype: float64

In [144]:
nba.mode(numeric_only=True)

   Salary
0   79568

In [145]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

## Sorting a DataFrame

### Sorting by a single column

In [146]:
nba.sort_values('Name')
nba.sort_values(by='Name')

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [147]:
nba.sort_values('Name', ascending=False).head()

                Name                  Team Position   Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17     79568
137  Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
312     Zhaire Smith    Philadelphia 76ers       SG 1999-06-04   3058800
302     Zach Norvell    Los Angeles Lakers       SG 1997-12-09     79568
159      Zach LaVine         Chicago Bulls       PG 1995-03-10  19500000

In [148]:
nba.sort_values('Birthday', ascending=False).head(n=5)

                    Name                  Team Position   Birthday   Salary
136      Sekou Doumbouya       Detroit Pistons       SF 2000-12-23  3285120
432  Talen Horton-Tucker    Los Angeles Lakers       GF 2000-11-25   898310
137      Zion Williamson  New Orleans Pelicans        F 2000-07-06  9757440
313           RJ Barrett       New York Knicks       SG 2000-06-14  7839960
392         Jalen Lecque          Phoenix Suns        G 2000-06-13   898310

### Sorting by multiple columns

In [149]:
nba.sort_values(by=['Team', 'Name'])

                Name                Team Position   Birthday    Salary
359         Alex Len       Atlanta Hawks        C 1993-06-16   4160000
167     Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
276  Brandon Goodwin       Atlanta Hawks       PG 1995-10-02     79568
438   Bruno Fernando       Atlanta Hawks        C 1998-08-15   1400000
194      Cam Reddish       Atlanta Hawks       SF 1999-09-01   4245720
..               ...                 ...      ...        ...       ...
418     Jordan McRae  Washington Wizards       PG 1991-03-28   1645357
273  Justin Robinson  Washington Wizards       PG 1997-10-12    898310
428    Moritz Wagner  Washington Wizards        C 1997-04-26   2063520
21     Rui Hachimura  Washington Wizards       PF 1998-02-08   4469160
36     Thomas Bryant  Washington Wizards        C 1997-07-31   8000000

[450 rows x 5 columns]

In [150]:
nba.sort_values(by=['Team', 'Name'], ascending=False)

                Name                Team Position   Birthday    Salary
36     Thomas Bryant  Washington Wizards        C 1997-07-31   8000000
21     Rui Hachimura  Washington Wizards       PF 1998-02-08   4469160
428    Moritz Wagner  Washington Wizards        C 1997-04-26   2063520
273  Justin Robinson  Washington Wizards       PG 1997-10-12    898310
418     Jordan McRae  Washington Wizards       PG 1991-03-28   1645357
..               ...                 ...      ...        ...       ...
194      Cam Reddish       Atlanta Hawks       SF 1999-09-01   4245720
438   Bruno Fernando       Atlanta Hawks        C 1998-08-15   1400000
276  Brandon Goodwin       Atlanta Hawks       PG 1995-10-02     79568
167     Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
359         Alex Len       Atlanta Hawks        C 1993-06-16   4160000

[450 rows x 5 columns]

In [151]:
nba.sort_values(by=['Team', 'Name'], ascending=[True, False])

                  Name                Team Position   Birthday    Salary
98        Vince Carter       Atlanta Hawks       PF 1977-01-26   2564753
290     Tyrone Wallace       Atlanta Hawks       PG 1994-06-10   1620564
20       Kevin Huerter       Atlanta Hawks       SG 1998-08-27   2636280
84        John Collins       Atlanta Hawks       PF 1997-09-23   2686560
339      Jabari Parker       Atlanta Hawks       PF 1995-03-15   6500000
..                 ...                 ...      ...        ...       ...
283   Garrison Mathews  Washington Wizards       SG 1996-10-24     79568
226      Davis Bertans  Washington Wizards       PF 1992-11-12   7000000
353      Chris Chiozza  Washington Wizards       PG 1995-11-21     79568
35        Bradley Beal  Washington Wizards       SG 1993-06-28  27093018
399  Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000

[450 rows x 5 columns]

In [152]:
nba = nba.sort_values(by=['Team', 'Salary'], ascending=[True, False])

## Sorting by index

In [153]:
nba.head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

### Sorting by row index

In [154]:
nba.sort_index().head()
nba.sort_index(ascending=True).head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [155]:
nba.sort_index().head()
nba.sort_index(ascending=False).head()

              Name                 Team Position   Birthday    Salary
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
446    Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
445  Austin Rivers      Houston Rockets       PG 1992-08-01   2174310

In [156]:
nba = nba.sort_index()

### Sorting by column index

In [157]:
nba.sort_index(axis='columns').head()
nba.sort_index(axis=1).head()

    Birthday            Name Position   Salary                Team
0 1996-09-26    Shake Milton       SG  1445697  Philadelphia 76ers
1 1995-09-27  Christian Wood       PF  1645357     Detroit Pistons
2 1998-08-23   PJ Washington       PF  3831840   Charlotte Hornets
3 1988-10-04    Derrick Rose       PG  7317074     Detroit Pistons
4 1995-07-26   Marial Shayok        G    79568  Philadelphia 76ers

In [158]:
nba.sort_index(axis='columns', ascending=False).head()

                 Team   Salary Position            Name   Birthday
0  Philadelphia 76ers  1445697       SG    Shake Milton 1996-09-26
1     Detroit Pistons  1645357       PF  Christian Wood 1995-09-27
2   Charlotte Hornets  3831840       PF   PJ Washington 1998-08-23
3     Detroit Pistons  7317074       PG    Derrick Rose 1988-10-04
4  Philadelphia 76ers    79568        G   Marial Shayok 1995-07-26

## Setting a new index

In [159]:
nba.set_index(keys='Name')
nba.set_index('Name')

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [160]:
nba = nba.set_index(keys='Name')

In [161]:
nba = pd.read_csv('nba.csv', parse_dates=['Birthday'], date_format='%m/%d/%y', index_col='Name')

## Selecting columns and rows from a DataFrame

In [162]:
nba.Salary

Name
Shake Milton       1445697
Christian Wood     1645357
PJ Washington      3831840
Derrick Rose       7317074
Marial Shayok        79568
                    ...
Austin Rivers      2174310
Harry Giles        2578800
Robin Lopez        4767000
Collin Sexton      4764960
Ricky Rubio       16200000
Name: Salary, Length: 450, dtype: int64

In [163]:
nba['Position']

Name
Shake Milton      SG
Christian Wood    PF
PJ Washington     PF
Derrick Rose      PG
Marial Shayok      G
                  ..
Austin Rivers     PG
Harry Giles       PF
Robin Lopez        C
Collin Sexton     PG
Ricky Rubio       PG
Name: Position, Length: 450, dtype: object

The advantage of the square-bracket syntax is that it supports column names with spaces.

### Selecting multiple columns from a DataFrame

In [164]:
nba[['Salary', 'Birthday']]

                  Salary   Birthday
Name
Shake Milton     1445697 1996-09-26
Christian Wood   1645357 1995-09-27
PJ Washington    3831840 1998-08-23
Derrick Rose     7317074 1988-10-04
Marial Shayok      79568 1995-07-26
...                  ...        ...
Austin Rivers    2174310 1992-08-01
Harry Giles      2578800 1998-04-22
Robin Lopez      4767000 1988-04-01
Collin Sexton    4764960 1999-01-04
Ricky Rubio     16200000 1990-10-21

[450 rows x 2 columns]

In [165]:
nba.select_dtypes(include='object').head()

                              Team Position
Name
Shake Milton    Philadelphia 76ers       SG
Christian Wood     Detroit Pistons       PF
PJ Washington    Charlotte Hornets       PF
Derrick Rose       Detroit Pistons       PG
Marial Shayok   Philadelphia 76ers        G

In [166]:
nba.select_dtypes(exclude=['object', 'int']).head()

                 Birthday
Name
Shake Milton   1996-09-26
Christian Wood 1995-09-27
PJ Washington  1998-08-23
Derrick Rose   1988-10-04
Marial Shayok  1995-07-26

In [167]:
nba.select_dtypes(include='datetime').sample(5)

                 Birthday
Name
Alec Burks     1991-07-20
Taurean Prince 1994-03-22
Isaac Bonga    1999-11-08
Kobi Simmons   1997-07-04
Jahlil Okafor  1995-12-15

## Selecting rows from a DataFrame

### Extracting rows by index label
The loc attribute extracts a row by label.

In [168]:
nba.loc['LeBron James']

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: LeBron James, dtype: object

In [169]:
nba.loc[['Kawhi Leonard', 'Paul George']]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

We can use loc to extract a sequence of index labels. The syntax mirrors Python’s list slicing syntax. We provide the starting value, a colon, and the ending value. For extractions like this one, I strongly recommended sorting the index first, as it accelerates the speed with which pandas finds the value.

In [170]:
nba.sort_index().loc['Otto Porter': 'Patrick Beverley']

                                  Team Position   Birthday    Salary
Name
Otto Porter              Chicago Bulls       SF 1993-06-03  27250576
PJ Dozier               Denver Nuggets       PG 1996-10-25     79568
PJ Washington        Charlotte Hornets       PF 1998-08-23   3831840
Pascal Siakam          Toronto Raptors       PF 1994-04-02   2351838
Pat Connaughton        Milwaukee Bucks       SG 1993-01-06   1723050
Patrick Beverley  Los Angeles Clippers       PG 1988-07-12  12345680

In [171]:
nba.sort_index().loc['Zach Collins':]

                                   Team Position   Birthday    Salary
Name
Zach Collins     Portland Trail Blazers        C 1997-11-19   4240200
Zach LaVine               Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell         Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith         Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson    New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham     New Orleans Pelicans       SF 1995-11-17     79568

In [172]:
nba.sort_index().loc[:'Al Horford']

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
Al Horford            Philadelphia 76ers        C 1986-06-03  28000000

In [174]:
nba.loc['Bugs Bunny']

KeyError: 'Bugs Bunny'

### Extracting rows by index position

In [175]:
nba.iloc[300]

Team             Denver Nuggets
Position                     PF
Birthday    1999-04-03 00:00:00
Salary                  1416852
Name: Jarred Vanderbilt, dtype: object

In [176]:
nba.iloc[[100, 200, 300, 400]]

                                Team Position   Birthday   Salary
Name
Brian Bowen           Indiana Pacers       SG 1998-10-02    79568
Marco Belinelli    San Antonio Spurs       SF 1986-03-25  5846154
Jarred Vanderbilt     Denver Nuggets       PF 1999-04-03  1416852
Louis King           Detroit Pistons        F 1999-04-06    79568

In [177]:
nba.iloc[400:404]

                                    Team Position   Birthday    Salary
Name
Louis King               Detroit Pistons        F 1999-04-06     79568
Kostas Antetokounmpo  Los Angeles Lakers       PF 1997-11-20     79568
Rodions Kurucs             Brooklyn Nets       PF 1998-02-05   1699236
Spencer Dinwiddie          Brooklyn Nets       PG 1993-04-06  10605600

In [178]:
nba.iloc[:2]

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

In [179]:
nba.iloc[445:]

                              Team Position   Birthday    Salary
Name
Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
Harry Giles       Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez        Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio           Phoenix Suns       PG 1990-10-21  16200000

In [180]:
nba.iloc[-10: -6]

                                    Team Position   Birthday   Salary
Name
Jared Dudley          Los Angeles Lakers       PF 1985-07-10  2564753
Max Strus                  Chicago Bulls       SG 1996-03-28    79568
Kevon Looney       Golden State Warriors        C 1996-02-06  4464286
Willy Hernangomez      Charlotte Hornets        C 1994-05-27  1557250

In [181]:
nba.iloc[0:10:2]

                             Team Position   Birthday    Salary
Name
Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
PJ Washington   Charlotte Hornets       PF 1998-08-23   3831840
Marial Shayok  Philadelphia 76ers        G 1995-07-26     79568
Kendrick Nunn          Miami Heat       SG 1995-08-03   1416852
Brook Lopez       Milwaukee Bucks        C 1988-04-01  12093024

### Extracting values from specific columns

In [182]:
nba.loc['Giannis Antetokounmpo', 'Team']

'Milwaukee Bucks'

In [183]:
nba.loc['James Harden', ['Position', 'Birthday']]

Position                     PG
Birthday    1989-08-26 00:00:00
Name: James Harden, dtype: object

In [184]:
nba.loc[['Russell Westbrook', 'Anthony Davis'], ['Team', 'Salary']]

                                 Team    Salary
Name
Russell Westbrook     Houston Rockets  38506482
Anthony Davis      Los Angeles Lakers  27093019

In [185]:
nba.loc['Joel Embiid', 'Position': 'Salary']

Position                      C
Birthday    1994-03-16 00:00:00
Salary                 27504630
Name: Joel Embiid, dtype: object

In [186]:
nba.loc['Joel Embiid', 'Salary': 'Position']

Series([], Name: Joel Embiid, dtype: object)

In [187]:
nba.iloc[57, 3]

796806

In [188]:
nba.iloc[100:104, :3]

                             Team Position   Birthday
Name
Brian Bowen        Indiana Pacers       SG 1998-10-02
Aaron Holiday      Indiana Pacers       PG 1996-09-30
Troy Daniels   Los Angeles Lakers       SG 1991-07-15
Buddy Hield      Sacramento Kings       SG 1992-12-17

In [189]:
nba.at['Austin Rivers', 'Birthday']

Timestamp('1992-08-01 00:00:00')

In [190]:
nba.iat[263, 1]

'PF'

In [191]:
%%timeit
nba.at['Austin Rivers', 'Birthday']

8.76 µs ± 772 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [192]:
%%timeit
nba.loc['Austin Rivers', 'Birthday']

12.6 µs ± 847 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [193]:
%%timeit
nba.iat[263, 1]

14 µs ± 450 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [194]:
%%timeit
nba.iloc[263, 1]

18.5 µs ± 529 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

## Extracting values from Series

In [195]:
nba['Salary'].loc['Damian Lillard']

29802321

In [196]:
nba['Salary'].at['Damian Lillard']

29802321

In [197]:
nba['Salary'].iloc[234]

2033160

In [198]:
nba['Salary'].iat[234]

2033160

## Renaming columns or rows

In [199]:
nba.columns

Index(['Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [200]:
nba.columns = ['Team', 'Position', 'Date of birthday', 'Pay']
nba.head(1)

                            Team Position Date of birthday      Pay
Name
Shake Milton  Philadelphia 76ers       SG       1996-09-26  1445697

In [201]:
nba.rename(columns={'Date of Birth': 'Birthday'})

                               Team Position Date of birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG       1996-09-26   1445697
Christian Wood      Detroit Pistons       PF       1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF       1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG       1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G       1995-07-26     79568
...                             ...      ...              ...       ...
Austin Rivers       Houston Rockets       PG       1992-08-01   2174310
Harry Giles        Sacramento Kings       PF       1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C       1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG       1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG       1990-10-21  16200000

[450 rows x 4 columns]

In [202]:
nba = nba.rename(columns={'Date of Birth': 'Birthday'})

In [203]:
nba.loc['Giannis Antetokounmpo']

Team                    Milwaukee Bucks
Position                             PF
Date of birthday    1994-12-06 00:00:00
Pay                            25842697
Name: Giannis Antetokounmpo, dtype: object

In [204]:
nba = nba.rename(index={'Giannis Antetokounmpo': 'Greek Freak'})

In [205]:
nba.loc['Greek Freak']

Team                    Milwaukee Bucks
Position                             PF
Date of birthday    1994-12-06 00:00:00
Pay                            25842697
Name: Greek Freak, dtype: object

## Resetting an index

In [206]:
nba.set_index('Team').head()

                   Position Date of birthday      Pay
Team
Philadelphia 76ers       SG       1996-09-26  1445697
Detroit Pistons          PF       1995-09-27  1645357
Charlotte Hornets        PF       1998-08-23  3831840
Detroit Pistons          PG       1988-10-04  7317074
Philadelphia 76ers        G       1995-07-26    79568

In [207]:
nba.reset_index().head()

             Name                Team Position Date of birthday      Pay
0    Shake Milton  Philadelphia 76ers       SG       1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF       1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF       1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG       1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G       1995-07-26    79568

In [208]:
nba.reset_index().set_index('Team').head()

                              Name Position Date of birthday      Pay
Team
Philadelphia 76ers    Shake Milton       SG       1996-09-26  1445697
Detroit Pistons     Christian Wood       PF       1995-09-27  1645357
Charlotte Hornets    PJ Washington       PF       1998-08-23  3831840
Detroit Pistons       Derrick Rose       PG       1988-10-04  7317074
Philadelphia 76ers   Marial Shayok        G       1995-07-26    79568

In [209]:
nba = nba.reset_index().set_index('Team')